% Автор:
% Дата: 06.12.2019

:-dynamic toy/2.


%...............................................................................


goal:- repeat,
       writeln("Выберите один из следующих пунктов меню:"),
       writeln("1 - Просмотреть содержимое динамической памяти;"),
       writeln("2 - Добавление записей;"),
       writeln("3 - Удаление записей;"),
       writeln("4 - Получение названия всех наиболее дорогих игрушек;"),
       writeln("5 - Выход (с сохранением)."),
       read(Choice),
       Choice < 6,
       proccess(Choice),
       Choice=5,!.
       

%...............................................................................

proccess(5).

%...............................................................................

proccess(1):- not(BD_open == 1),
              write("Введите имя базы данных: "),
              read(NameBD),
              consult(NameBD),
              findall((Name,Cost), toy(Name,Cost), ToysList),
              write_bd(ToysList),
              BD_open is 1.

write_bd([]):- !.
write_bd([H|T]):- writeln(H),
                 write_bd(T),!.
                 
%...............................................................................
                 
%proccess(2):-.


%...............................................................................

%proccess(3):-.

%...............................................................................

%proccess(4):-.


                 